ThirdParty-v2012/swak4Foam-latest/Examples/groovyBC/jumpChannel/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Sample for creating baffles:
// - usually converting internal faces into two boundary faces
// - or converting boundary faces into a boundary face
//   (internalFacesOnly=false)(though should use really createPatch
//    to do this)
//
// - selection of faces (and orientation) to 'baffle' through:
//      faceZone:
//          type        faceZone;
//          zoneName    f0;
//      searchableSurface:
//          type        searchableSurface;
//          surface     triSurfaceMesh;
//          name        baffle1D.stl;
//
// - specification of patches for baffle sides in one of two modes:
//      - patchPairs : create two patches of same type, same input
//      - patches    : create patches separately, full control over what
//                     to create on what side
//                     (this mode can also create duplicate (overlapping)
//                      sets of baffles:
//                      - internalFacesOnly = false
//                      - have 4 entries in patches:
//                          - master
//                          - slave
//                          - additional master
//                          - additional slave)


// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly true;

// Optionally do not read/convert/write any fields.
noFields true;


// Baffles to create.
baffles
{
    baffle1
    {
        //- Use surface to select faces and orientation.
        type        faceZone;
        zoneName    jump1;

        // Generate patchGroup baffle1 with two patches:
        //  - baffle1_master
        //  - baffle1_slave

        // Generate patches explicitly
        patches
        {
            master
            {
                //- Master side patch

                name            jump1_master;
                type            cyclic;
                neighbourPatch  jump1_slave;
            }
            slave
            {
                //- Slave side patch

                name            jump1_slave;
                type            cyclic;
                neighbourPatch  jump1_master;
            }
        }
    }
    baffle2
    {
        //- Use surface to select faces and orientation.
        type        faceZone;
        zoneName    jump2;

        // Generate patchGroup baffle2 with two patches:
        //  - baffle2_master
        //  - baffle2_slave

        // Generate patches explicitly
        patches
        {
            master
            {
                //- Master side patch

                name            jump2_master;
                type            cyclic;
                neighbourPatch  jump2_slave;
            }
            slave
            {
                //- Slave side patch

                name            jump2_slave;
                type            cyclic;
                neighbourPatch  jump2_master;
            }
        }
    }
}


// ************************************************************************* //
